
const mockDailyExam = {
  'items': [
    {
      "staticNumber": 1,
      "question": "16. 项目需要一位熟练的工程师来执行某个特定任务，但由于工作量大，该工程师不能参与这个项目。项目经理下一步应该怎么做？",
      "answerList": [{
        "key": "A",
        "value": "A. 修改进度计划，以适应该资源。"
      },
      {
        "key": "B",
        "value": "B. 与职能经理协商该资源的参与。"
      },
      {
        "key": "C",
        "value": "C. 培训项目团队中的某个成员来执行所需的活动。"
      },
      {
        "key": "D",
        "value": "D. 要求发起人提供更多的时间来寻找其他资源来执行任务。"
      }
      ],
      "rightAnswer": "B",
      "explain": "B。解释：本题为资源冲突问题，有冲突要面对，矩阵型组织中，资源的管理权由职能经理控制，因此要找职能经理面对、谈判。本题也可以当成相关方问题，由于相关方（该工程师的职能经理）对该项目不重视（工作量大，不能参与，就是重视程度不够；如果是生病、辞职不能参与，则另当别论），影响了项目，要管理相关方参与，也是选B，见PMBOK527页13.3.2.3中的谈判（英文谈判、协商一个词）。",
      "belongs": {
        "type": "simulated",
        "value": "5"
      },
      "_id": "4435748e-758d-4c24-886e-3248200006002",
    },
    {
      "staticNumber": 2,
      "question": "17.在项目执行阶段，项目发起人直接与团队成员和分包商沟通。项目发起人偶尔向他们提供有关实施方法、工作技巧和任务排序的指导。项目经理应该怎么做？",
      "answerList": [{
        "key": "A",
        "value": "A.制定风险分解结构(RBS) 。"
      },
      {
        "key": "B",
        "value": "B.根据影响的严重程度来评估风险，"
      },
      {
        "key": "C",
        "value": "C.实施风险策略。"
      },
      {
        "key": "D",
        "value": "D.使用变更管理计划。"
      }
      ],
      "rightAnswer": "B",
      "explain": "B 解释：本题为风险套路题目。风险管理的套路：识别-定性分析-定量分析-制定应对计划-实施应对计划或监控。题目描述的情景为风险已识别，下一步应该先定性定量分析，即B。有学员选C，首先从题目描述看，还没有制定风险应对策略，因此B不现实。不选A，A是规划风险管理过程的工作，目的是为识别风险做准备；D与本题无关。",
      "belongs": {
        "type": "simulated",
        "value": "5"
      },
      "_id": "4435748e-758d-4c24-886e-3248200006002",
    },
    {
      "staticNumber": 3,
      "question": "18. 一名团队成员急于将客户正在考虑的新功能添加到项目可交付成果中。在开始为这些新功能工作之前，需要谁的批准？",
      "answerList": [{
        "key": "A",
        "value": "A.项目经理"
      },
      {
        "key": "B",
        "value": "B.变更控制委员会(CCB)"
      },
      {
        "key": "C",
        "value": "C.项目发起人。"
      },
      {
        "key": "D",
        "value": "D.主题专家(SME)"
      }
      ],
      "rightAnswer": "B",
      "explain": "选B 解释：本题比较基础，实际在问：谁来批准变更？——基准变更由CCB批准。添加新功能，即增加项目范围，就是范围基准变更。",
      "belongs": {
        "type": "simulated",
        "value": "5"
      },
      "_id": "4435748e-758d-4c24-886e-3248200006002",
    },
    {
      "staticNumber": 4,
      "question": "19. 项目经理发现公司的质量保证(QA)部门可能没有足够的人员根据合同约定的进度计划测试项目产品。项目经理首先应该怎么做？",
      "answerList": [{
        "key": "A",
        "value": "A.审查问题日志"
      },
      {
        "key": "B",
        "value": "B.更新风险登记册"
      },
      {
        "key": "C",
        "value": "C.取消一些非关键测试"
      },
      {
        "key": "D",
        "value": "D.压缩进度计划"
      }
      ],
      "rightAnswer": "B",
      "explain": "B 解释：本题涉及进度、资源、质量、风险，问题比较开放，应使用排除法。缺少测试人员，可能导致进度延误。这是一个风险，当然也可以当成一个问题。不选A，如果A是记录在问题日志则可以选，但A是查看，刚刚发现的问题，问题日志尚未记录，看也白看；C是为进度牺牲质量，错误；D，缺少资源的情况下，还压缩进度，是方向性错误，应该考虑的是资源平衡。B，当成新识别的风险记录，是可以的。",
      "belongs": {
        "type": "simulated",
        "value": "5"
      },
      "_id": "4435748e-758d-4c24-886e-3248200006002",
    },
    {
      "staticNumber": 5,
      "question": "20. 项目经理正在另一个国家执行一个IT外包项目，客户抱怨说远程团队没有达到他们的质量标准。项目经理应该查阅哪一份文件来确认这一点？",
      "answerList": [{
        "key": "A",
        "value": "A.外包公司的质量政策"
      },
      {
        "key": "B",
        "value": "B.质量控制测量结果"
      },
      {
        "key": "C",
        "value": "C.采购工作说明书(SOW)"
      },
      {
        "key": "D",
        "value": "D.质量管理计划"
      }
      ],
      "rightAnswer": "B",
      "explain": "B 解释：抱怨未必是事实，结果是否符合质量标准，要查看质量检查结果，即质量控制测量结果，看计划或目标无用，CD都是目标。如同奋斗目标是三十岁挣它一个亿，是否达到了目标，要看银行存款或支付宝余额。本题在PMBOK中有直接依据，见PMBOK291页第2个小黑点：质量控制测量结果用于分析和评估项目过程和可交付成果是否符合执行组织的标准或特定要求。A是质量管理的指导原则，不显示具体质量指标。",
      "belongs": {
        "type": "simulated",
        "value": "5"
      },
      "_id": "4435748e-758d-4c24-886e-3248200006002",
    }
  ]
}

const mock = {
  mockDailyExam: mockDailyExam
}

module.exports = mock
